mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/common/s6e2c5xj.h
#define bFM_BT8_PWM_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8220UL))
#define bFM4_BT8_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A8220UL))

#define bFM_BT8_RT_STC_UDIR                       *((volatile  uint8_t *)(0x424A8200UL))
#define bFM4_BT8_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424A8200UL))
#define bFM_BT8_RT_STC_TGIR                       *((volatile  uint8_t *)(0x424A8208UL))
#define bFM4_BT8_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424A8208UL))
#define bFM_BT8_RT_STC_UDIE                       *((volatile  uint8_t *)(0x424A8210UL))
#define bFM4_BT8_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424A8210UL))
#define bFM_BT8_RT_STC_TGIE                       *((volatile  uint8_t *)(0x424A8218UL))
#define bFM4_BT8_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424A8218UL))

#define bFM_BT8_RT_TMCR_STRG                      *((volatile  uint8_t *)(0x424A8180UL))
#define bFM4_BT8_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A8180UL))
#define bFM_BT8_RT_TMCR_CTEN                      *((volatile  uint8_t *)(0x424A8184UL))
#define bFM4_BT8_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8184UL))
#define bFM_BT8_RT_TMCR_MDSE                      *((volatile  uint8_t *)(0x424A8188UL))
#define bFM4_BT8_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8188UL))
#define bFM_BT8_RT_TMCR_OSEL                      *((volatile  uint8_t *)(0x424A818CUL))
#define bFM4_BT8_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A818CUL))
#define bFM_BT8_RT_TMCR_T32                       *((volatile  uint8_t *)(0x424A819CUL))
#define bFM4_BT8_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A819CUL))

#define bFM_BT8_RT_TMCR2_CKS3                     *((volatile  uint8_t *)(0x424A8220UL))
#define bFM4_BT8_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8220UL))
#define bFM_BT8_RT_TMCR2_GATE                     *((volatile  uint8_t *)(0x424A823CUL))
#define bFM4_BT8_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A823CUL))


/*******************************************************************************
* BT Registers BT9
*   Bitband Section
*******************************************************************************/
#define bFM_BT9_PPG_STC_UDIR                      *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM4_BT9_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM_BT9_PPG_STC_TGIR                      *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM4_BT9_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM_BT9_PPG_STC_UDIE                      *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM4_BT9_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM_BT9_PPG_STC_TGIE                      *((volatile  uint8_t *)(0x424A8A18UL))
#define bFM4_BT9_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424A8A18UL))

#define bFM_BT9_PPG_TMCR_STRG                     *((volatile  uint8_t *)(0x424A8980UL))
#define bFM4_BT9_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424A8980UL))
#define bFM_BT9_PPG_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8984UL))
#define bFM4_BT9_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A8984UL))
#define bFM_BT9_PPG_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8988UL))
#define bFM4_BT9_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A8988UL))
#define bFM_BT9_PPG_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A898CUL))
#define bFM4_BT9_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A898CUL))
#define bFM_BT9_PPG_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A89A8UL))
#define bFM4_BT9_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A89A8UL))
#define bFM_BT9_PPG_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A89ACUL))
#define bFM4_BT9_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A89ACUL))

#define bFM_BT9_PPG_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8A20UL))
#define bFM4_BT9_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A8A20UL))

#define bFM_BT9_PWC_STC_OVIR                      *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM4_BT9_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM_BT9_PWC_STC_EDIR                      *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM4_BT9_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM_BT9_PWC_STC_OVIE                      *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM4_BT9_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM_BT9_PWC_STC_EDIE                      *((volatile  uint8_t *)(0x424A8A18UL))
#define bFM4_BT9_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424A8A18UL))
#define bFM_BT9_PWC_STC_ERR                       *((volatile  uint8_t *)(0x424A8A1CUL))
#define bFM4_BT9_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424A8A1CUL))

#define bFM_BT9_PWC_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8984UL))
#define bFM4_BT9_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A8984UL))
#define bFM_BT9_PWC_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8988UL))
#define bFM4_BT9_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A8988UL))
#define bFM_BT9_PWC_TMCR_T32                      *((volatile  uint8_t *)(0x424A899CUL))
#define bFM4_BT9_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424A899CUL))

#define bFM_BT9_PWC_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8A20UL))
#define bFM4_BT9_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A8A20UL))

#define bFM_BT9_PWM_STC_UDIR                      *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM4_BT9_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM_BT9_PWM_STC_DTIR                      *((volatile  uint8_t *)(0x424A8A04UL))
#define bFM4_BT9_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424A8A04UL))
#define bFM_BT9_PWM_STC_TGIR                      *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM4_BT9_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM_BT9_PWM_STC_UDIE                      *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM4_BT9_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM_BT9_PWM_STC_DTIE                      *((volatile  uint8_t *)(0x424A8A14UL))
#define bFM4_BT9_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424A8A14UL))
#define bFM_BT9_PWM_STC_TGIE                      *((volatile  uint8_t *)(0x424A8A18UL))
#define bFM4_BT9_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424A8A18UL))

#define bFM_BT9_PWM_TMCR_STRG                     *((volatile  uint8_t *)(0x424A8980UL))
#define bFM4_BT9_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424A8980UL))
#define bFM_BT9_PWM_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8984UL))
#define bFM4_BT9_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A8984UL))
#define bFM_BT9_PWM_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8988UL))
#define bFM4_BT9_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A8988UL))
#define bFM_BT9_PWM_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A898CUL))
#define bFM4_BT9_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A898CUL))
#define bFM_BT9_PWM_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A89A8UL))
#define bFM4_BT9_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A89A8UL))
#define bFM_BT9_PWM_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A89ACUL))
#define bFM4_BT9_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A89ACUL))

#define bFM_BT9_PWM_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8A20UL))
#define bFM4_BT9_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A8A20UL))

#define bFM_BT9_RT_STC_UDIR                       *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM4_BT9_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424A8A00UL))
#define bFM_BT9_RT_STC_TGIR                       *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM4_BT9_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424A8A08UL))
#define bFM_BT9_RT_STC_UDIE                       *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM4_BT9_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424A8A10UL))
#define bFM_BT9_RT_STC_TGIE                       *((volatile  uint8_t *)(0x424A8A18UL))
#define bFM4_BT9_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424A8A18UL))

