mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/common/s6e2c5xj.h
#define bFM_GPIO_PZRE_P0                          *((volatile  uint8_t *)(0x42DEE700UL))
#define bFM4_GPIO_PZRE_P0                         *((volatile  uint8_t *)(0x42DEE700UL))
#define bFM_GPIO_PZRE_P2                          *((volatile  uint8_t *)(0x42DEE708UL))
#define bFM4_GPIO_PZRE_P2                         *((volatile  uint8_t *)(0x42DEE708UL))
#define bFM_GPIO_PZRE_P3                          *((volatile  uint8_t *)(0x42DEE70CUL))
#define bFM4_GPIO_PZRE_P3                         *((volatile  uint8_t *)(0x42DEE70CUL))

#define bFM_GPIO_PZRF_P0                          *((volatile  uint8_t *)(0x42DEE780UL))
#define bFM4_GPIO_PZRF_P0                         *((volatile  uint8_t *)(0x42DEE780UL))
#define bFM_GPIO_PZRF_P1                          *((volatile  uint8_t *)(0x42DEE784UL))
#define bFM4_GPIO_PZRF_P1                         *((volatile  uint8_t *)(0x42DEE784UL))
#define bFM_GPIO_PZRF_P2                          *((volatile  uint8_t *)(0x42DEE788UL))
#define bFM4_GPIO_PZRF_P2                         *((volatile  uint8_t *)(0x42DEE788UL))
#define bFM_GPIO_PZRF_P3                          *((volatile  uint8_t *)(0x42DEE78CUL))
#define bFM4_GPIO_PZRF_P3                         *((volatile  uint8_t *)(0x42DEE78CUL))
#define bFM_GPIO_PZRF_P4                          *((volatile  uint8_t *)(0x42DEE790UL))
#define bFM4_GPIO_PZRF_P4                         *((volatile  uint8_t *)(0x42DEE790UL))
#define bFM_GPIO_PZRF_P5                          *((volatile  uint8_t *)(0x42DEE794UL))
#define bFM4_GPIO_PZRF_P5                         *((volatile  uint8_t *)(0x42DEE794UL))
#define bFM_GPIO_PZRF_P6                          *((volatile  uint8_t *)(0x42DEE798UL))
#define bFM4_GPIO_PZRF_P6                         *((volatile  uint8_t *)(0x42DEE798UL))
#define bFM_GPIO_PZRF_P7                          *((volatile  uint8_t *)(0x42DEE79CUL))
#define bFM4_GPIO_PZRF_P7                         *((volatile  uint8_t *)(0x42DEE79CUL))

#define bFM_GPIO_SPSR_USB0C                       *((volatile  uint8_t *)(0x42DEB010UL))
#define bFM4_GPIO_SPSR_USB0C                      *((volatile  uint8_t *)(0x42DEB010UL))
#define bFM_GPIO_SPSR_USB1C                       *((volatile  uint8_t *)(0x42DEB014UL))
#define bFM4_GPIO_SPSR_USB1C                      *((volatile  uint8_t *)(0x42DEB014UL))


/*******************************************************************************
* HSSPI Registers HSSPI
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* HWWDT Registers HWWDT
*   Bitband Section
*******************************************************************************/
#define bFM_HWWDT_WDG_CTL_INTEN                   *((volatile  uint32_t*)(0x42220100UL))
#define bFM4_HWWDT_WDG_CTL_INTEN                  *((volatile  uint32_t*)(0x42220100UL))
#define bFM_HWWDT_WDG_CTL_RESEN                   *((volatile  uint32_t*)(0x42220104UL))
#define bFM4_HWWDT_WDG_CTL_RESEN                  *((volatile  uint32_t*)(0x42220104UL))

#define bFM_HWWDT_WDG_RIS_RIS                     *((volatile  uint32_t*)(0x42220200UL))
#define bFM4_HWWDT_WDG_RIS_RIS                    *((volatile  uint32_t*)(0x42220200UL))


/*******************************************************************************
* I2S Registers I2S0
*   Bitband Section
*******************************************************************************/
#define bFM_I2S0_CNTREG_FSPL                      *((volatile  uint8_t *)(0x42D80100UL))
#define bFM4_I2S0_CNTREG_FSPL                     *((volatile  uint8_t *)(0x42D80100UL))
#define bFM_I2S0_CNTREG_FSLN                      *((volatile  uint8_t *)(0x42D80104UL))
#define bFM4_I2S0_CNTREG_FSLN                     *((volatile  uint8_t *)(0x42D80104UL))
#define bFM_I2S0_CNTREG_FSPH                      *((volatile  uint8_t *)(0x42D80108UL))
#define bFM4_I2S0_CNTREG_FSPH                     *((volatile  uint8_t *)(0x42D80108UL))
#define bFM_I2S0_CNTREG_CPOL                      *((volatile  uint8_t *)(0x42D8010CUL))
#define bFM4_I2S0_CNTREG_CPOL                     *((volatile  uint8_t *)(0x42D8010CUL))
#define bFM_I2S0_CNTREG_SMPL                      *((volatile  uint8_t *)(0x42D80110UL))
#define bFM4_I2S0_CNTREG_SMPL                     *((volatile  uint8_t *)(0x42D80110UL))
#define bFM_I2S0_CNTREG_RXDIS                     *((volatile  uint8_t *)(0x42D80114UL))
#define bFM4_I2S0_CNTREG_RXDIS                    *((volatile  uint8_t *)(0x42D80114UL))
#define bFM_I2S0_CNTREG_TXDIS                     *((volatile  uint8_t *)(0x42D80118UL))
#define bFM4_I2S0_CNTREG_TXDIS                    *((volatile  uint8_t *)(0x42D80118UL))
#define bFM_I2S0_CNTREG_MLSB                      *((volatile  uint8_t *)(0x42D8011CUL))
#define bFM4_I2S0_CNTREG_MLSB                     *((volatile  uint8_t *)(0x42D8011CUL))
#define bFM_I2S0_CNTREG_FRUN                      *((volatile  uint8_t *)(0x42D80120UL))
#define bFM4_I2S0_CNTREG_FRUN                     *((volatile  uint8_t *)(0x42D80120UL))
#define bFM_I2S0_CNTREG_BEXT                      *((volatile  uint8_t *)(0x42D80124UL))
#define bFM4_I2S0_CNTREG_BEXT                     *((volatile  uint8_t *)(0x42D80124UL))
#define bFM_I2S0_CNTREG_ECKM                      *((volatile  uint8_t *)(0x42D80128UL))
#define bFM4_I2S0_CNTREG_ECKM                     *((volatile  uint8_t *)(0x42D80128UL))
#define bFM_I2S0_CNTREG_RHLL                      *((volatile  uint8_t *)(0x42D8012CUL))
#define bFM4_I2S0_CNTREG_RHLL                     *((volatile  uint8_t *)(0x42D8012CUL))
#define bFM_I2S0_CNTREG_SBFN                      *((volatile  uint8_t *)(0x42D80130UL))
#define bFM4_I2S0_CNTREG_SBFN                     *((volatile  uint8_t *)(0x42D80130UL))
#define bFM_I2S0_CNTREG_MSMD                      *((volatile  uint8_t *)(0x42D80134UL))
#define bFM4_I2S0_CNTREG_MSMD                     *((volatile  uint8_t *)(0x42D80134UL))
#define bFM_I2S0_CNTREG_MSKB                      *((volatile  uint8_t *)(0x42D80138UL))
#define bFM4_I2S0_CNTREG_MSKB                     *((volatile  uint8_t *)(0x42D80138UL))

