mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/common/s6e2c5xj.h
#define bFM_MFS10_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x42714020UL))
#define bFM4_MFS10_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x42714020UL))
#define bFM_MFS10_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x42714024UL))
#define bFM4_MFS10_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x42714024UL))
#define bFM_MFS10_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x42714028UL))
#define bFM4_MFS10_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x42714028UL))
#define bFM_MFS10_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271402CUL))
#define bFM4_MFS10_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4271402CUL))
#define bFM_MFS10_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x42714030UL))
#define bFM4_MFS10_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x42714030UL))
#define bFM_MFS10_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x42714034UL))
#define bFM4_MFS10_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x42714034UL))
#define bFM_MFS10_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x42714038UL))
#define bFM4_MFS10_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x42714038UL))
#define bFM_MFS10_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271403CUL))
#define bFM4_MFS10_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4271403CUL))

#define bFM_MFS10_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x42714080UL))
#define bFM4_MFS10_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x42714080UL))
#define bFM_MFS10_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x42714084UL))
#define bFM4_MFS10_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x42714084UL))
#define bFM_MFS10_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x42714088UL))
#define bFM4_MFS10_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x42714088UL))
#define bFM_MFS10_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271408CUL))
#define bFM4_MFS10_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4271408CUL))
#define bFM_MFS10_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x42714090UL))
#define bFM4_MFS10_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x42714090UL))
#define bFM_MFS10_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x42714094UL))
#define bFM4_MFS10_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x42714094UL))
#define bFM_MFS10_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x42714098UL))
#define bFM4_MFS10_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x42714098UL))
#define bFM_MFS10_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271409CUL))
#define bFM4_MFS10_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4271409CUL))

#define bFM_MFS10_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271421CUL))
#define bFM4_MFS10_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4271421CUL))

#define bFM_MFS10_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271423CUL))
#define bFM4_MFS10_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4271423CUL))

#define bFM_MFS10_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x42714008UL))
#define bFM4_MFS10_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x42714008UL))
#define bFM_MFS10_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271400CUL))
#define bFM4_MFS10_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4271400CUL))

#define bFM_MFS10_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x427140A0UL))
#define bFM4_MFS10_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x427140A0UL))
#define bFM_MFS10_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x427140A4UL))
#define bFM4_MFS10_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x427140A4UL))
#define bFM_MFS10_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x427140A8UL))
#define bFM4_MFS10_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x427140A8UL))
#define bFM_MFS10_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x427140ACUL))
#define bFM4_MFS10_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x427140ACUL))
#define bFM_MFS10_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x427140B0UL))
#define bFM4_MFS10_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x427140B0UL))
#define bFM_MFS10_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x427140B4UL))
#define bFM4_MFS10_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x427140B4UL))
#define bFM_MFS10_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x427140B8UL))
#define bFM4_MFS10_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x427140B8UL))
#define bFM_MFS10_I2C_SSR_REC                     *((volatile  uint8_t *)(0x427140BCUL))
#define bFM4_MFS10_I2C_SSR_REC                    *((volatile  uint8_t *)(0x427140BCUL))

#define bFM_MFS10_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x427141BCUL))
#define bFM4_MFS10_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x427141BCUL))

#define bFM_MFS10_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x42714090UL))
#define bFM4_MFS10_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x42714090UL))
#define bFM_MFS10_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x42714098UL))
#define bFM4_MFS10_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x42714098UL))

#define bFM_MFS10_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x42714280UL))
#define bFM4_MFS10_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x42714280UL))
#define bFM_MFS10_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x42714284UL))
#define bFM4_MFS10_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x42714284UL))
#define bFM_MFS10_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x42714288UL))
#define bFM4_MFS10_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x42714288UL))
#define bFM_MFS10_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271428CUL))
#define bFM4_MFS10_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4271428CUL))
#define bFM_MFS10_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x42714290UL))
#define bFM4_MFS10_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x42714290UL))
#define bFM_MFS10_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x42714294UL))
#define bFM4_MFS10_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x42714294UL))
#define bFM_MFS10_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x42714298UL))
#define bFM4_MFS10_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x42714298UL))
#define bFM_MFS10_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x427142A0UL))
#define bFM4_MFS10_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x427142A0UL))
#define bFM_MFS10_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x427142A4UL))
#define bFM4_MFS10_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x427142A4UL))
#define bFM_MFS10_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x427142A8UL))
#define bFM4_MFS10_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x427142A8UL))
#define bFM_MFS10_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x427142ACUL))
#define bFM4_MFS10_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x427142ACUL))
#define bFM_MFS10_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x427142B0UL))
#define bFM4_MFS10_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x427142B0UL))

