mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/common/s6e2c5xj.h
/*******************************************************************************
* MFS Registers MFS11
*   Bitband Section
*******************************************************************************/
#define bFM_MFS11_CSIO_ESCR_CSFE                  *((volatile  uint8_t *)(0x42716094UL))
#define bFM4_MFS11_CSIO_ESCR_CSFE                 *((volatile  uint8_t *)(0x42716094UL))
#define bFM_MFS11_CSIO_ESCR_L3                    *((volatile  uint8_t *)(0x42716098UL))
#define bFM4_MFS11_CSIO_ESCR_L3                   *((volatile  uint8_t *)(0x42716098UL))
#define bFM_MFS11_CSIO_ESCR_SOP                   *((volatile  uint8_t *)(0x4271609CUL))
#define bFM4_MFS11_CSIO_ESCR_SOP                  *((volatile  uint8_t *)(0x4271609CUL))

#define bFM_MFS11_CSIO_FCR_FE1                    *((volatile  uint8_t *)(0x42716280UL))
#define bFM4_MFS11_CSIO_FCR_FE1                   *((volatile  uint8_t *)(0x42716280UL))
#define bFM_MFS11_CSIO_FCR_FE2                    *((volatile  uint8_t *)(0x42716284UL))
#define bFM4_MFS11_CSIO_FCR_FE2                   *((volatile  uint8_t *)(0x42716284UL))
#define bFM_MFS11_CSIO_FCR_FCL1                   *((volatile  uint8_t *)(0x42716288UL))
#define bFM4_MFS11_CSIO_FCR_FCL1                  *((volatile  uint8_t *)(0x42716288UL))
#define bFM_MFS11_CSIO_FCR_FCL2                   *((volatile  uint8_t *)(0x4271628CUL))
#define bFM4_MFS11_CSIO_FCR_FCL2                  *((volatile  uint8_t *)(0x4271628CUL))
#define bFM_MFS11_CSIO_FCR_FSET                   *((volatile  uint8_t *)(0x42716290UL))
#define bFM4_MFS11_CSIO_FCR_FSET                  *((volatile  uint8_t *)(0x42716290UL))
#define bFM_MFS11_CSIO_FCR_FLD                    *((volatile  uint8_t *)(0x42716294UL))
#define bFM4_MFS11_CSIO_FCR_FLD                   *((volatile  uint8_t *)(0x42716294UL))
#define bFM_MFS11_CSIO_FCR_FLST                   *((volatile  uint8_t *)(0x42716298UL))
#define bFM4_MFS11_CSIO_FCR_FLST                  *((volatile  uint8_t *)(0x42716298UL))
#define bFM_MFS11_CSIO_FCR_FSEL                   *((volatile  uint8_t *)(0x427162A0UL))
#define bFM4_MFS11_CSIO_FCR_FSEL                  *((volatile  uint8_t *)(0x427162A0UL))
#define bFM_MFS11_CSIO_FCR_FTIE                   *((volatile  uint8_t *)(0x427162A4UL))
#define bFM4_MFS11_CSIO_FCR_FTIE                  *((volatile  uint8_t *)(0x427162A4UL))
#define bFM_MFS11_CSIO_FCR_FDRQ                   *((volatile  uint8_t *)(0x427162A8UL))
#define bFM4_MFS11_CSIO_FCR_FDRQ                  *((volatile  uint8_t *)(0x427162A8UL))
#define bFM_MFS11_CSIO_FCR_FRIIE                  *((volatile  uint8_t *)(0x427162ACUL))
#define bFM4_MFS11_CSIO_FCR_FRIIE                 *((volatile  uint8_t *)(0x427162ACUL))
#define bFM_MFS11_CSIO_FCR_FLSTE                  *((volatile  uint8_t *)(0x427162B0UL))
#define bFM4_MFS11_CSIO_FCR_FLSTE                 *((volatile  uint8_t *)(0x427162B0UL))

#define bFM_MFS11_CSIO_SACSR_TMRE                 *((volatile  uint8_t *)(0x42716480UL))
#define bFM4_MFS11_CSIO_SACSR_TMRE                *((volatile  uint8_t *)(0x42716480UL))
#define bFM_MFS11_CSIO_SACSR_TSYNE                *((volatile  uint8_t *)(0x42716498UL))
#define bFM4_MFS11_CSIO_SACSR_TSYNE               *((volatile  uint8_t *)(0x42716498UL))
#define bFM_MFS11_CSIO_SACSR_TINTE                *((volatile  uint8_t *)(0x4271649CUL))
#define bFM4_MFS11_CSIO_SACSR_TINTE               *((volatile  uint8_t *)(0x4271649CUL))
#define bFM_MFS11_CSIO_SACSR_TINT                 *((volatile  uint8_t *)(0x427164A0UL))
#define bFM4_MFS11_CSIO_SACSR_TINT                *((volatile  uint8_t *)(0x427164A0UL))
#define bFM_MFS11_CSIO_SACSR_CSE                  *((volatile  uint8_t *)(0x427164ACUL))
#define bFM4_MFS11_CSIO_SACSR_CSE                 *((volatile  uint8_t *)(0x427164ACUL))
#define bFM_MFS11_CSIO_SACSR_CSEIE                *((volatile  uint8_t *)(0x427164B0UL))
#define bFM4_MFS11_CSIO_SACSR_CSEIE               *((volatile  uint8_t *)(0x427164B0UL))
#define bFM_MFS11_CSIO_SACSR_TBEEN                *((volatile  uint8_t *)(0x427164B4UL))
#define bFM4_MFS11_CSIO_SACSR_TBEEN               *((volatile  uint8_t *)(0x427164B4UL))

#define bFM_MFS11_CSIO_SCR_TXE                    *((volatile  uint8_t *)(0x42716020UL))
#define bFM4_MFS11_CSIO_SCR_TXE                   *((volatile  uint8_t *)(0x42716020UL))
#define bFM_MFS11_CSIO_SCR_RXE                    *((volatile  uint8_t *)(0x42716024UL))
#define bFM4_MFS11_CSIO_SCR_RXE                   *((volatile  uint8_t *)(0x42716024UL))
#define bFM_MFS11_CSIO_SCR_TBIE                   *((volatile  uint8_t *)(0x42716028UL))
#define bFM4_MFS11_CSIO_SCR_TBIE                  *((volatile  uint8_t *)(0x42716028UL))
#define bFM_MFS11_CSIO_SCR_TIE                    *((volatile  uint8_t *)(0x4271602CUL))
#define bFM4_MFS11_CSIO_SCR_TIE                   *((volatile  uint8_t *)(0x4271602CUL))
#define bFM_MFS11_CSIO_SCR_RIE                    *((volatile  uint8_t *)(0x42716030UL))
#define bFM4_MFS11_CSIO_SCR_RIE                   *((volatile  uint8_t *)(0x42716030UL))
#define bFM_MFS11_CSIO_SCR_SPI                    *((volatile  uint8_t *)(0x42716034UL))
#define bFM4_MFS11_CSIO_SCR_SPI                   *((volatile  uint8_t *)(0x42716034UL))
#define bFM_MFS11_CSIO_SCR_MS                     *((volatile  uint8_t *)(0x42716038UL))
#define bFM4_MFS11_CSIO_SCR_MS                    *((volatile  uint8_t *)(0x42716038UL))
#define bFM_MFS11_CSIO_SCR_UPCL                   *((volatile  uint8_t *)(0x4271603CUL))
#define bFM4_MFS11_CSIO_SCR_UPCL                  *((volatile  uint8_t *)(0x4271603CUL))

#define bFM_MFS11_CSIO_SCSCR_CSOE                 *((volatile  uint8_t *)(0x42716600UL))
#define bFM4_MFS11_CSIO_SCSCR_CSOE                *((volatile  uint8_t *)(0x42716600UL))
#define bFM_MFS11_CSIO_SCSCR_CSEN0                *((volatile  uint8_t *)(0x42716604UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN0               *((volatile  uint8_t *)(0x42716604UL))
#define bFM_MFS11_CSIO_SCSCR_CSEN1                *((volatile  uint8_t *)(0x42716608UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN1               *((volatile  uint8_t *)(0x42716608UL))
#define bFM_MFS11_CSIO_SCSCR_CSEN2                *((volatile  uint8_t *)(0x4271660CUL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN2               *((volatile  uint8_t *)(0x4271660CUL))
#define bFM_MFS11_CSIO_SCSCR_CSEN3                *((volatile  uint8_t *)(0x42716610UL))
#define bFM4_MFS11_CSIO_SCSCR_CSEN3               *((volatile  uint8_t *)(0x42716610UL))
#define bFM_MFS11_CSIO_SCSCR_CSLVL                *((volatile  uint8_t *)(0x42716614UL))
#define bFM4_MFS11_CSIO_SCSCR_CSLVL               *((volatile  uint8_t *)(0x42716614UL))
#define bFM_MFS11_CSIO_SCSCR_SCAM                 *((volatile  uint8_t *)(0x42716624UL))
#define bFM4_MFS11_CSIO_SCSCR_SCAM                *((volatile  uint8_t *)(0x42716624UL))

#define bFM_MFS11_CSIO_SCSFR0_CS1SPI              *((volatile  uint8_t *)(0x42716694UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1SPI             *((volatile  uint8_t *)(0x42716694UL))
#define bFM_MFS11_CSIO_SCSFR0_CS1SCINV            *((volatile  uint8_t *)(0x42716698UL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1SCINV           *((volatile  uint8_t *)(0x42716698UL))
#define bFM_MFS11_CSIO_SCSFR0_CS1CSLVL            *((volatile  uint8_t *)(0x4271669CUL))
#define bFM4_MFS11_CSIO_SCSFR0_CS1CSLVL           *((volatile  uint8_t *)(0x4271669CUL))

#define bFM_MFS11_CSIO_SCSFR1_CS2SPI              *((volatile  uint8_t *)(0x427166B4UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x427166B4UL))
#define bFM_MFS11_CSIO_SCSFR1_CS2SCINV            *((volatile  uint8_t *)(0x427166B8UL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x427166B8UL))
#define bFM_MFS11_CSIO_SCSFR1_CS2CSLVL            *((volatile  uint8_t *)(0x427166BCUL))
#define bFM4_MFS11_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x427166BCUL))

#define bFM_MFS11_CSIO_SCSFR2_CS3SPI              *((volatile  uint8_t *)(0x42716714UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x42716714UL))
#define bFM_MFS11_CSIO_SCSFR2_CS3SCINV            *((volatile  uint8_t *)(0x42716718UL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x42716718UL))
#define bFM_MFS11_CSIO_SCSFR2_CS3CSLVL            *((volatile  uint8_t *)(0x4271671CUL))
#define bFM4_MFS11_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4271671CUL))

#define bFM_MFS11_CSIO_SMR_SOE                    *((volatile  uint8_t *)(0x42716000UL))
#define bFM4_MFS11_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x42716000UL))
#define bFM_MFS11_CSIO_SMR_SCKE                   *((volatile  uint8_t *)(0x42716004UL))
#define bFM4_MFS11_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x42716004UL))
#define bFM_MFS11_CSIO_SMR_BDS                    *((volatile  uint8_t *)(0x42716008UL))
#define bFM4_MFS11_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x42716008UL))
#define bFM_MFS11_CSIO_SMR_SCINV                  *((volatile  uint8_t *)(0x4271600CUL))
#define bFM4_MFS11_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4271600CUL))

#define bFM_MFS11_CSIO_SSR_TBI                    *((volatile  uint8_t *)(0x427160A0UL))
#define bFM4_MFS11_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x427160A0UL))
#define bFM_MFS11_CSIO_SSR_TDRE                   *((volatile  uint8_t *)(0x427160A4UL))
#define bFM4_MFS11_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x427160A4UL))
#define bFM_MFS11_CSIO_SSR_RDRF                   *((volatile  uint8_t *)(0x427160A8UL))
#define bFM4_MFS11_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x427160A8UL))
#define bFM_MFS11_CSIO_SSR_ORE                    *((volatile  uint8_t *)(0x427160ACUL))
#define bFM4_MFS11_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x427160ACUL))
#define bFM_MFS11_CSIO_SSR_AWC                    *((volatile  uint8_t *)(0x427160B0UL))
#define bFM4_MFS11_CSIO_SSR_AWC                   *((volatile  uint8_t *)(0x427160B0UL))
#define bFM_MFS11_CSIO_SSR_REC                    *((volatile  uint8_t *)(0x427160BCUL))
#define bFM4_MFS11_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x427160BCUL))

#define bFM_MFS11_I2C_EIBCR_BEC                   *((volatile  uint8_t *)(0x427163A0UL))
#define bFM4_MFS11_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x427163A0UL))
#define bFM_MFS11_I2C_EIBCR_SOCE                  *((volatile  uint8_t *)(0x427163A4UL))
#define bFM4_MFS11_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x427163A4UL))
#define bFM_MFS11_I2C_EIBCR_SCLC                  *((volatile  uint8_t *)(0x427163A8UL))
#define bFM4_MFS11_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x427163A8UL))
#define bFM_MFS11_I2C_EIBCR_SDAC                  *((volatile  uint8_t *)(0x427163ACUL))
#define bFM4_MFS11_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x427163ACUL))
#define bFM_MFS11_I2C_EIBCR_SCLS                  *((volatile  uint8_t *)(0x427163B0UL))
#define bFM4_MFS11_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x427163B0UL))
#define bFM_MFS11_I2C_EIBCR_SDAS                  *((volatile  uint8_t *)(0x427163B4UL))
#define bFM4_MFS11_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x427163B4UL))

#define bFM_MFS11_I2C_FCR_FE1                     *((volatile  uint8_t *)(0x42716280UL))
#define bFM4_MFS11_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x42716280UL))
#define bFM_MFS11_I2C_FCR_FE2                     *((volatile  uint8_t *)(0x42716284UL))
#define bFM4_MFS11_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x42716284UL))
#define bFM_MFS11_I2C_FCR_FCL1                    *((volatile  uint8_t *)(0x42716288UL))
#define bFM4_MFS11_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x42716288UL))
#define bFM_MFS11_I2C_FCR_FCL2                    *((volatile  uint8_t *)(0x4271628CUL))
#define bFM4_MFS11_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4271628CUL))
#define bFM_MFS11_I2C_FCR_FSET                    *((volatile  uint8_t *)(0x42716290UL))
#define bFM4_MFS11_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x42716290UL))
#define bFM_MFS11_I2C_FCR_FLD                     *((volatile  uint8_t *)(0x42716294UL))
#define bFM4_MFS11_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x42716294UL))
#define bFM_MFS11_I2C_FCR_FLST                    *((volatile  uint8_t *)(0x42716298UL))
#define bFM4_MFS11_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x42716298UL))
#define bFM_MFS11_I2C_FCR_FSEL                    *((volatile  uint8_t *)(0x427162A0UL))
#define bFM4_MFS11_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x427162A0UL))
#define bFM_MFS11_I2C_FCR_FTIE                    *((volatile  uint8_t *)(0x427162A4UL))
#define bFM4_MFS11_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x427162A4UL))
#define bFM_MFS11_I2C_FCR_FDRQ                    *((volatile  uint8_t *)(0x427162A8UL))
#define bFM4_MFS11_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x427162A8UL))
#define bFM_MFS11_I2C_FCR_FRIIE                   *((volatile  uint8_t *)(0x427162ACUL))
#define bFM4_MFS11_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x427162ACUL))
#define bFM_MFS11_I2C_FCR_FLSTE                   *((volatile  uint8_t *)(0x427162B0UL))
#define bFM4_MFS11_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x427162B0UL))

#define bFM_MFS11_I2C_IBCR_INT                    *((volatile  uint8_t *)(0x42716020UL))
#define bFM4_MFS11_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x42716020UL))
#define bFM_MFS11_I2C_IBCR_BER                    *((volatile  uint8_t *)(0x42716024UL))
#define bFM4_MFS11_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x42716024UL))
#define bFM_MFS11_I2C_IBCR_INTE                   *((volatile  uint8_t *)(0x42716028UL))
#define bFM4_MFS11_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x42716028UL))
#define bFM_MFS11_I2C_IBCR_CNDE                   *((volatile  uint8_t *)(0x4271602CUL))
#define bFM4_MFS11_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4271602CUL))
#define bFM_MFS11_I2C_IBCR_WSEL                   *((volatile  uint8_t *)(0x42716030UL))
#define bFM4_MFS11_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x42716030UL))
#define bFM_MFS11_I2C_IBCR_ACKE                   *((volatile  uint8_t *)(0x42716034UL))
#define bFM4_MFS11_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x42716034UL))
#define bFM_MFS11_I2C_IBCR_ACT_SCC                *((volatile  uint8_t *)(0x42716038UL))
#define bFM4_MFS11_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x42716038UL))
#define bFM_MFS11_I2C_IBCR_MSS                    *((volatile  uint8_t *)(0x4271603CUL))
#define bFM4_MFS11_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4271603CUL))

