mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c5xj/common/s6e2c5xj.h
#define bFM_SDIF_FEACEST_FEVNT12ND                *((volatile  uint8_t *)(0x42DC0A00UL))
#define bFM4_SDIF_FEACEST_FEVNT12ND               *((volatile  uint8_t *)(0x42DC0A00UL))
#define bFM_SDIF_FEACEST_FEVNTTO                  *((volatile  uint8_t *)(0x42DC0A04UL))
#define bFM4_SDIF_FEACEST_FEVNTTO                 *((volatile  uint8_t *)(0x42DC0A04UL))
#define bFM_SDIF_FEACEST_FEVNTCRC                 *((volatile  uint8_t *)(0x42DC0A08UL))
#define bFM4_SDIF_FEACEST_FEVNTCRC                *((volatile  uint8_t *)(0x42DC0A08UL))
#define bFM_SDIF_FEACEST_FEVNTEB                  *((volatile  uint8_t *)(0x42DC0A0CUL))
#define bFM4_SDIF_FEACEST_FEVNTEB                 *((volatile  uint8_t *)(0x42DC0A0CUL))
#define bFM_SDIF_FEACEST_FEVNTIDX                 *((volatile  uint8_t *)(0x42DC0A10UL))
#define bFM4_SDIF_FEACEST_FEVNTIDX                *((volatile  uint8_t *)(0x42DC0A10UL))
#define bFM_SDIF_FEACEST_FEVNTCMD12               *((volatile  uint8_t *)(0x42DC0A1CUL))
#define bFM4_SDIF_FEACEST_FEVNTCMD12              *((volatile  uint8_t *)(0x42DC0A1CUL))

#define bFM_SDIF_MCWIRQC0_WTIRQEN                 *((volatile  uint8_t *)(0x42DC2500UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQEN                *((volatile  uint8_t *)(0x42DC2500UL))
#define bFM_SDIF_MCWIRQC0_WTIRQST                 *((volatile  uint8_t *)(0x42DC2504UL))
#define bFM4_SDIF_MCWIRQC0_WTIRQST                *((volatile  uint8_t *)(0x42DC2504UL))

#define bFM_SDIF_MMCSDCH_BTACKENMMC               *((volatile  uint8_t *)(0x42DC24C0UL))
#define bFM4_SDIF_MMCSDCH_BTACKENMMC              *((volatile  uint8_t *)(0x42DC24C0UL))
#define bFM_SDIF_MMCSDCH_BTABTENMMC               *((volatile  uint8_t *)(0x42DC24C4UL))
#define bFM4_SDIF_MMCSDCH_BTABTENMMC              *((volatile  uint8_t *)(0x42DC24C4UL))
#define bFM_SDIF_MMCSDCH_BTMDENMMC                *((volatile  uint8_t *)(0x42DC24C8UL))
#define bFM4_SDIF_MMCSDCH_BTMDENMMC               *((volatile  uint8_t *)(0x42DC24C8UL))

#define bFM_SDIF_MMCSDCL_LCKRSTESD                *((volatile  uint8_t *)(0x42DC2480UL))
#define bFM4_SDIF_MMCSDCL_LCKRSTESD               *((volatile  uint8_t *)(0x42DC2480UL))
#define bFM_SDIF_MMCSDCL_RSTMMC                   *((volatile  uint8_t *)(0x42DC2484UL))
#define bFM4_SDIF_MMCSDCL_RSTMMC                  *((volatile  uint8_t *)(0x42DC2484UL))
#define bFM_SDIF_MMCSDCL_VCCCTLMMC                *((volatile  uint8_t *)(0x42DC2488UL))
#define bFM4_SDIF_MMCSDCL_VCCCTLMMC               *((volatile  uint8_t *)(0x42DC2488UL))
#define bFM_SDIF_MMCSDCL_VCCQCTLMMC               *((volatile  uint8_t *)(0x42DC248CUL))
#define bFM4_SDIF_MMCSDCL_VCCQCTLMMC              *((volatile  uint8_t *)(0x42DC248CUL))
#define bFM_SDIF_MMCSDCL_MMCDDRSEL                *((volatile  uint8_t *)(0x42DC24A0UL))
#define bFM4_SDIF_MMCSDCL_MMCDDRSEL               *((volatile  uint8_t *)(0x42DC24A0UL))
#define bFM_SDIF_MMCSDCL_CMDDATDLY                *((volatile  uint8_t *)(0x42DC24A4UL))
#define bFM4_SDIF_MMCSDCL_CMDDATDLY               *((volatile  uint8_t *)(0x42DC24A4UL))

#define bFM_SDIF_PSWISGEL_INT5MSSGEN              *((volatile  uint8_t *)(0x42DC2400UL))
#define bFM4_SDIF_PSWISGEL_INT5MSSGEN             *((volatile  uint8_t *)(0x42DC2400UL))
#define bFM_SDIF_PSWISGEL_INT1MSSGEN              *((volatile  uint8_t *)(0x42DC2404UL))
#define bFM4_SDIF_PSWISGEL_INT1MSSGEN             *((volatile  uint8_t *)(0x42DC2404UL))

#define bFM_SDIF_PSWISTEL_INT5MSSTS               *((volatile  uint8_t *)(0x42DC2380UL))
#define bFM4_SDIF_PSWISTEL_INT5MSSTS              *((volatile  uint8_t *)(0x42DC2380UL))
#define bFM_SDIF_PSWISTEL_INT1MSSTS               *((volatile  uint8_t *)(0x42DC2384UL))
#define bFM4_SDIF_PSWISTEL_INT1MSSTS              *((volatile  uint8_t *)(0x42DC2384UL))

#define bFM_SDIF_PSWISTL_INT5MS                   *((volatile  uint8_t *)(0x42DC2300UL))
#define bFM4_SDIF_PSWISTL_INT5MS                  *((volatile  uint8_t *)(0x42DC2300UL))
#define bFM_SDIF_PSWISTL_INT1MS                   *((volatile  uint8_t *)(0x42DC2304UL))
#define bFM4_SDIF_PSWISTL_INT1MS                  *((volatile  uint8_t *)(0x42DC2304UL))

#define bFM_SDIF_SACMDEST_ACMD12NOEX              *((volatile  uint8_t *)(0x42DC0780UL))
#define bFM4_SDIF_SACMDEST_ACMD12NOEX             *((volatile  uint8_t *)(0x42DC0780UL))
#define bFM_SDIF_SACMDEST_ACMDTOERR               *((volatile  uint8_t *)(0x42DC0784UL))
#define bFM4_SDIF_SACMDEST_ACMDTOERR              *((volatile  uint8_t *)(0x42DC0784UL))
#define bFM_SDIF_SACMDEST_ACMDCRCERR              *((volatile  uint8_t *)(0x42DC0788UL))
#define bFM4_SDIF_SACMDEST_ACMDCRCERR             *((volatile  uint8_t *)(0x42DC0788UL))
#define bFM_SDIF_SACMDEST_ACMDEBERR               *((volatile  uint8_t *)(0x42DC078CUL))
#define bFM4_SDIF_SACMDEST_ACMDEBERR              *((volatile  uint8_t *)(0x42DC078CUL))
#define bFM_SDIF_SACMDEST_ACMDIDXERR              *((volatile  uint8_t *)(0x42DC0790UL))
#define bFM4_SDIF_SACMDEST_ACMDIDXERR             *((volatile  uint8_t *)(0x42DC0790UL))
#define bFM_SDIF_SACMDEST_CMDND12ERR              *((volatile  uint8_t *)(0x42DC079CUL))
#define bFM4_SDIF_SACMDEST_CMDND12ERR             *((volatile  uint8_t *)(0x42DC079CUL))

#define bFM_SDIF_SBLKGPCTL_BLCKGSTPREQ            *((volatile  uint8_t *)(0x42DC0540UL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGSTPREQ           *((volatile  uint8_t *)(0x42DC0540UL))
#define bFM_SDIF_SBLKGPCTL_CONTREQ                *((volatile  uint8_t *)(0x42DC0544UL))
#define bFM4_SDIF_SBLKGPCTL_CONTREQ               *((volatile  uint8_t *)(0x42DC0544UL))
#define bFM_SDIF_SBLKGPCTL_RDWAITCTL              *((volatile  uint8_t *)(0x42DC0548UL))
#define bFM4_SDIF_SBLKGPCTL_RDWAITCTL             *((volatile  uint8_t *)(0x42DC0548UL))
#define bFM_SDIF_SBLKGPCTL_BLCKGAPINT             *((volatile  uint8_t *)(0x42DC054CUL))
#define bFM4_SDIF_SBLKGPCTL_BLCKGAPINT            *((volatile  uint8_t *)(0x42DC054CUL))

#define bFM_SDIF_SCLKCTL_INTLCLCKEN               *((volatile  uint8_t *)(0x42DC0580UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKEN              *((volatile  uint8_t *)(0x42DC0580UL))
#define bFM_SDIF_SCLKCTL_INTLCLCKST               *((volatile  uint8_t *)(0x42DC0584UL))
#define bFM4_SDIF_SCLKCTL_INTLCLCKST              *((volatile  uint8_t *)(0x42DC0584UL))
#define bFM_SDIF_SCLKCTL_SDCLCKEN                 *((volatile  uint8_t *)(0x42DC0588UL))
#define bFM4_SDIF_SCLKCTL_SDCLCKEN                *((volatile  uint8_t *)(0x42DC0588UL))
#define bFM_SDIF_SCLKCTL_CLCKGENSEL               *((volatile  uint8_t *)(0x42DC0594UL))
#define bFM4_SDIF_SCLKCTL_CLCKGENSEL              *((volatile  uint8_t *)(0x42DC0594UL))

#define bFM_SDIF_SCMMD_CMDCRCCHKE                 *((volatile  uint8_t *)(0x42DC01CCUL))
#define bFM4_SDIF_SCMMD_CMDCRCCHKE                *((volatile  uint8_t *)(0x42DC01CCUL))
#define bFM_SDIF_SCMMD_CMDIDXCHKE                 *((volatile  uint8_t *)(0x42DC01D0UL))
#define bFM4_SDIF_SCMMD_CMDIDXCHKE                *((volatile  uint8_t *)(0x42DC01D0UL))
#define bFM_SDIF_SCMMD_DATPRESSEL                 *((volatile  uint8_t *)(0x42DC01D4UL))
#define bFM4_SDIF_SCMMD_DATPRESSEL                *((volatile  uint8_t *)(0x42DC01D4UL))

#define bFM_SDIF_SEINTSGE_CMDTOERRG               *((volatile  uint8_t *)(0x42DC0740UL))
#define bFM4_SDIF_SEINTSGE_CMDTOERRG              *((volatile  uint8_t *)(0x42DC0740UL))
#define bFM_SDIF_SEINTSGE_CMDCRCERRG              *((volatile  uint8_t *)(0x42DC0744UL))
#define bFM4_SDIF_SEINTSGE_CMDCRCERRG             *((volatile  uint8_t *)(0x42DC0744UL))
#define bFM_SDIF_SEINTSGE_CMDEBERRG               *((volatile  uint8_t *)(0x42DC0748UL))
#define bFM4_SDIF_SEINTSGE_CMDEBERRG              *((volatile  uint8_t *)(0x42DC0748UL))
#define bFM_SDIF_SEINTSGE_CMDIDXERRG              *((volatile  uint8_t *)(0x42DC074CUL))
#define bFM4_SDIF_SEINTSGE_CMDIDXERRG             *((volatile  uint8_t *)(0x42DC074CUL))
#define bFM_SDIF_SEINTSGE_DTTOERRG                *((volatile  uint8_t *)(0x42DC0750UL))
#define bFM4_SDIF_SEINTSGE_DTTOERRG               *((volatile  uint8_t *)(0x42DC0750UL))
#define bFM_SDIF_SEINTSGE_DTCRCERRG               *((volatile  uint8_t *)(0x42DC0754UL))
#define bFM4_SDIF_SEINTSGE_DTCRCERRG              *((volatile  uint8_t *)(0x42DC0754UL))
#define bFM_SDIF_SEINTSGE_DTEBERRG                *((volatile  uint8_t *)(0x42DC0758UL))
#define bFM4_SDIF_SEINTSGE_DTEBERRG               *((volatile  uint8_t *)(0x42DC0758UL))
#define bFM_SDIF_SEINTSGE_CRTLMTERRG              *((volatile  uint8_t *)(0x42DC075CUL))
#define bFM4_SDIF_SEINTSGE_CRTLMTERRG             *((volatile  uint8_t *)(0x42DC075CUL))
#define bFM_SDIF_SEINTSGE_ACMD12ERRG              *((volatile  uint8_t *)(0x42DC0760UL))
#define bFM4_SDIF_SEINTSGE_ACMD12ERRG             *((volatile  uint8_t *)(0x42DC0760UL))
#define bFM_SDIF_SEINTSGE_ADMAERRG                *((volatile  uint8_t *)(0x42DC0764UL))
#define bFM4_SDIF_SEINTSGE_ADMAERRG               *((volatile  uint8_t *)(0x42DC0764UL))
#define bFM_SDIF_SEINTSGE_TUNINGERRG              *((volatile  uint8_t *)(0x42DC0768UL))
#define bFM4_SDIF_SEINTSGE_TUNINGERRG             *((volatile  uint8_t *)(0x42DC0768UL))
#define bFM_SDIF_SEINTSGE_BTACKERRG               *((volatile  uint8_t *)(0x42DC0770UL))
#define bFM4_SDIF_SEINTSGE_BTACKERRG              *((volatile  uint8_t *)(0x42DC0770UL))
#define bFM_SDIF_SEINTSGE_ACMD19ERRG              *((volatile  uint8_t *)(0x42DC0774UL))
#define bFM4_SDIF_SEINTSGE_ACMD19ERRG             *((volatile  uint8_t *)(0x42DC0774UL))
#define bFM_SDIF_SEINTSGE_AHBMSTERRG              *((volatile  uint8_t *)(0x42DC0778UL))
#define bFM4_SDIF_SEINTSGE_AHBMSTERRG             *((volatile  uint8_t *)(0x42DC0778UL))

